# STOR 320: Introduction to Data Science
# Lab 4

**Name:** Conor Jones

**Instructions:** Fill in the blanks as necessary and complete the questions below.

Remember to submit the lab to gradescope.

In [4]:
# Just run this cell
import numpy as np
import pandas as pd

rng = np.random.default_rng(42)

## Handling Missing Data

**0. What are the two main approaches to dealing with missing data and a trade-off of each?**

You can either get rid of the rows that the data is in. The tradeoff for this is that you will have less data to build you models off of. You could aoso remove the NA and replace with a alteranive like mean or mdiean. This may comporise your data as it would rping in the standard devation.

**1. What are the two modes of storing and manipulating null data in Pandas?**

You can have Series and Dataframes

**2. Any array containing `None` must have what dtype?**

An array containing None will have the object dtype in NumPy.

**3. Run the cells below. Why does the operation on `dtype=object` take so much longer than `dtype=int`?**

In [3]:
%timeit np.arange(1E6, dtype=int).sum()

2.93 ms ± 177 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [4]:
%timeit np.arange(1E6, dtype=object).sum()

89.9 ms ± 2.07 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

This happens because NumPy can process int arrays using optimized C code, but it must handle object arrays element by element, which takes longer.

**4. Try to run the code cells below. Why does the `.sum()` call on `vals1` throw an error?**

In [5]:
# Create an array with None object
vals1 = np.array([1, None, 2, 3])
vals1

array([1, None, 2, 3], dtype=object)

In [6]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

It throws an error because None is not a numeric type, so the array cannot perform a summation over mixed types.

**5. What is the main downside to `NaN`?**

NaN could make it so you forget about the vars making it so you miscount

**6. Run the code cells below. What two changes did Pandas automatically make when you ran `x[0] = None`? Why?**

In [7]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [11]:
x[0] = "hello"
x

str

Pandas automatically converted the int dtype to float and replaced None with NaN, because NaN is the floating-point of missing data.

**7. Fill in the blank:** 
In Pandas, strings are always stored with a/an _________ dtype.

object

**8. You are given the following DataFrame `df` which contains information about students' test scores in different subjects. Some of the data is missing.**

1. Count the number of missing values in each column and display the missing counts.
2. Fill the missing values in the 'Math' column with the median value of the 'Math' column and display `df`.
3. Fill missing values in the 'Science' and 'History' columns with the mean value of their respective columns and display `df`. There should only be one null value left in `df`.
4. Create a new column 'Total_Score' which is the sum of the scores in all subjects for each student. Handle missing values by treating them as zeros in the summation. Display `df`.
5. Interpolate missing value linearly in the 'English' column. Display `df`. Explain the difference between forward fill and linear interpolation and what would have resulted if we would have used forward fill instead of interpolation. Hint: Look at using `.interpolate`

In [5]:
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Math': [85, 92, np.nan, 74, np.nan],
    'Science': [np.nan, 88, 93, 81, np.nan],
    'English': [79, np.nan, 85, 90, 87],
    'History': [88, 76, np.nan, np.nan, 80]
}

df = pd.DataFrame(data)
df

   Student  Math  Science  English  History
0    Alice  85.0      NaN     79.0     88.0
1      Bob  92.0     88.0      NaN     76.0
2  Charlie   NaN     93.0     85.0      NaN
3    David  74.0     81.0     90.0      NaN
4      Eve   NaN      NaN     87.0     80.0

In [6]:
df.isnull().count()

Student    5
Math       5
Science    5
English    5
History    5
dtype: int64

In [7]:
df['Math'] = df['Math'].fillna(df['Math'].median())
df

   Student  Math  Science  English  History
0    Alice  85.0      NaN     79.0     88.0
1      Bob  92.0     88.0      NaN     76.0
2  Charlie  85.0     93.0     85.0      NaN
3    David  74.0     81.0     90.0      NaN
4      Eve  85.0      NaN     87.0     80.0

In [8]:
#3. Fill missing values in the 'Science' and 'History' columns with the mean 
#value of their respective columns and display `df`. There should only be one null value left in `df`.
df['Science'] = df['Science'].fillna(df['Science'].mean())
df['History'] = df['History'].fillna(df['History'].mean())
df

   Student  Math    Science  English    History
0    Alice  85.0  87.333333     79.0  88.000000
1      Bob  92.0  88.000000      NaN  76.000000
2  Charlie  85.0  93.000000     85.0  81.333333
3    David  74.0  81.000000     90.0  81.333333
4      Eve  85.0  87.333333     87.0  80.000000

In [77]:
#4. Create a new column 'Total_Score' which is the sum of the scores in all subjects for each student.
#  Handle missing values by treating them as zeros in the summation. Display `df`.

df['Total_Score'] = df.iloc[:,1:4].fillna(0).sum(axis=1)
df

   Student       Math    Science  English    History  Total_Score
0    Alice  85.000000  87.333333     79.0  88.000000   251.333333
1      Bob  92.000000  88.000000      NaN  76.000000   180.000000
2  Charlie  83.666667  93.000000     85.0  81.333333   261.666667
3    David  74.000000  81.000000     90.0  81.333333   245.000000
4      Eve  83.666667  87.333333     87.0  80.000000   258.000000

In [ ]:
#5. Interpolate missing value linearly in the 'English' column. Display `df`. 
# Explain the difference between forward fill and linear interpolation and what 
# would have resulted if we would have used forward fill instead of interpolation. 
# Hint: Look at using `.interpolate`

In [9]:
df['Total_Score'] = df.iloc[:, 1:].fillna(0).sum(axis=1)
df

   Student  Math    Science  English    History  Total_Score
0    Alice  85.0  87.333333     79.0  88.000000   339.333333
1      Bob  92.0  88.000000      NaN  76.000000   256.000000
2  Charlie  85.0  93.000000     85.0  81.333333   344.333333
3    David  74.0  81.000000     90.0  81.333333   326.333333
4      Eve  85.0  87.333333     87.0  80.000000   339.333333

In [11]:
print(df['English'].interpolate())
df['English'].ffill()

0    79.0
1    82.0
2    85.0
3    90.0
4    87.0
Name: English, dtype: float64

0    79.0
1    79.0
2    85.0
3    90.0
4    87.0
Name: English, dtype: float64

In [12]:
df['Total_Score'] = df.iloc[:, 1:].fillna(0).sum(axis=1)
df

   Student  Math    Science  English    History  Total_Score
0    Alice  85.0  87.333333     79.0  88.000000   678.666667
1      Bob  92.0  88.000000      NaN  76.000000   512.000000
2  Charlie  85.0  93.000000     85.0  81.333333   688.666667
3    David  74.0  81.000000     90.0  81.333333   652.666667
4      Eve  85.0  87.333333     87.0  80.000000   678.666667

In [14]:
print(df['English'].interpolate())
df['English'].ffill()

0    79.0
1    82.0
2    85.0
3    90.0
4    87.0
Name: English, dtype: float64

0    79.0
1    79.0
2    85.0
3    90.0
4    87.0
Name: English, dtype: float64

The diffrence between the two is that interplate will take the average between the on infront and the one behind while forward fill will just repalce it with the vale that was before it.

## Heirarchical Indexing

**9. Run the code cell below. What do the blank values in the first column represent in the hierarchical representation of the data?**

In [15]:
# Use Python tuples as keys
index = [('California', 2010), ('California', 2020),
         ('New York', 2010), ('New York', 2020),
         ('Texas', 2010), ('Texas', 2020)]

populations = [37253956, 39538223,
               19378102, 20201249,
               25145561, 29145505]
pop = pd.Series(populations, index=index)
pop

# Create a multi-index from the tuples
index = pd.MultiIndex.from_tuples(index)

# Hierarchical representation of the data
pop = pop.reindex(index)
pop

California  2010    37253956
            2020    39538223
New York    2010    19378102
            2020    20201249
Texas       2010    25145561
            2020    29145505
dtype: int64

This is a mutindex so we for the years and the popuation ssezes we dont need to woiry we just use the thing whatever the above key is.

**10. You are given the following MultiIndexed Series sales which contains quarterly sales data for different regions and products.**

1. Display the sales data for 'North' region.
2. Display the sales data for 'Product_B' across all regions.
3. Display the sales data for 'North' region and 'Product_A'.
4. Display the sales data for 'South' and 'West' regions only.
5. Display the sales data for 'North' and 'South' regions and 'Product_B'.

In [16]:
index = pd.MultiIndex.from_product(
    [['North', 'South', 'East', 'West'], ['Product_A', 'Product_B']],
    names=['Region', 'Product']
)

data = [150, 200, 100, 220, 130, 190, 170, 210]

sales = pd.Series(data, index=index)
sales

Region  Product
North   Product_A    150
        Product_B    200
South   Product_A    100
        Product_B    220
East    Product_A    130
        Product_B    190
West    Product_A    170
        Product_B    210
dtype: int64

In [17]:
sales['North']

Product
Product_A    150
Product_B    200
dtype: int64

In [84]:
sales[:,"Product_B"]

Region
North    200
South    220
East     190
West     210
dtype: int64

In [18]:
sales["North","Product_A"]

150

In [91]:
sales[["North","West"]]

Region  Product
North   Product_A    150
        Product_B    200
West    Product_A    170
        Product_B    210
dtype: int64

In [19]:
sales.loc[['North', 'South'], 'Product_B']

Region  Product
North   Product_B    200
South   Product_B    220
dtype: int64

**11. The code below throws an errors because we cannot slice within a tuple. Provide the correct version of the code and explain what the code is doing.**

In [22]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                            names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'],
                                      ['HR', 'Temp']],
                                       names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)

# try to slice the DataFrame
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (4060745080.py, line 16)

In [26]:
health_data.loc[(slice(None), 1), (slice(None), 'HR')]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      26.0  24.0  36.0
2014 1      37.0  54.0  16.0

Answer:

**12. Fill in the blank:** Partial slices and other similar operations require the levels in the `MultiIndex` to be in sorted (i.e., lexicographical) order.

Answer:

**13. What does the `level=0` vs. `level=1` parameter change in the `.unstack()` function?**

Answer:The level=0 parameter in .unstack() moves the first level of the index to become the column labels, while level=1 moves the second level of the index to the columns. This allows you to pivot different levels of a MultiIndex from rows to columns.

**14. You are given the following MultiIndexed DataFrame sales_data which contains quarterly sales data for different products across multiple regions and years. You should use the original `sales_data` DataFrame to perform each task.**

1. Unstack the 'Region' level and display the resulting DataFrame.
2. Swap the levels 'Year' and 'Region' and display the resulting DataFrame. Hint: Look at using `.swaplevels`
3. Slice the data to retrieve sales information for 'Product_A' in the 'South' region for the year 2020 for quarters Q2 and Q3. Display your answer.

In [27]:
index = pd.MultiIndex.from_product(
    [['2019', '2020'], ['North', 'South'], ['Product_A', 'Product_B'], ['Q1', 'Q2', 'Q3', 'Q4']],
    names=['Year', 'Region', 'Product', 'Quarter']
)

data = np.random.randint(100, 1000, size=(32, 1))

sales_data = pd.DataFrame(data, index=index, columns=['Sales'])

In [28]:
sales_data.unstack('Region')
sales_data.swaplevel('Year', 'Region').sort_index()
sales_data.loc[('2020', 'South', 'Product_A', ['Q2', 'Q3']), :]

                               Sales
Year Region Product   Quarter
2020 South  Product_A Q2         250
                      Q3         222